### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_namespace.onp_seichi_debug_minecraft will be created
+   resource "kubernetes_namespace" "onp_seichi_debug_minecraft" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "seichi-debug-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.onp_seichi_minecraft will be created
+   resource "kubernetes_namespace" "onp_seichi_minecraft" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_one_day_to_reset_secrets["seichi-debug-minecraft"] will be created
+   resource "kubernetes_secret" "onp_minecraft_one_day_to_reset_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--one-day-to-reset--config-secrets"
+           namespace        = "seichi-debug-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_one_day_to_reset_secrets["seichi-minecraft"] will be created
+   resource "kubernetes_secret" "onp_minecraft_one_day_to_reset_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--one-day-to-reset--config-secrets"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_secrets["seichi-debug-minecraft"] will be created
+   resource "kubernetes_secret" "onp_minecraft_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--common--config-secrets"
+           namespace        = "seichi-debug-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.onp_minecraft_secrets["seichi-minecraft"] will be created
+   resource "kubernetes_secret" "onp_minecraft_secrets" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mcserver--common--config-secrets"
+           namespace        = "seichi-minecraft"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>